Revit 2026 API

# ITransientElementMaker Methods

---

The ITransientElementMaker type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Execute | Implement this method to create transient elements. |

#### Reference

ITransientElementMaker Interface

Autodesk.Revit.DB Namespace